/*
Запросити у користувача рік народження.
Запитати в нього, в якому місті він живе.
Запитати його улюблений вид спорту.
При натисканні на ОК показуємо вікно, де має бути відображена наступна інформація:
Його вік.
Якщо користувач запровадить Київ, Вашингтон чи Лондон, то показати йому 
повідомлення - "Ти живеш у столиці..." і на місце точок підставляємо країну, 
столицю якої він запровадив. Інакше показуємо йому “ти живеш у місті…” і місце точок – введене місто.
Вибираємо самі три види спорту та три чемпіони у цих видах. Відповідно, якщо користувач 
запровадить один із цих видів спорту, то показуємо йому повідомлення “Круто! Хочеш стати…” і 
підставляємо на місце точок ім'я та прізвище чемпіона.
Все це має бути відображено в одному вікні (алерті).
Якщо в якомусь випадку він не захоче вводити інформацію і натисне Скасувати, 
показати йому повідомлення - "Шкода, що Ви не захотіли ввести свій(ю) ..." і 
вказуємо, що він не захотів вводити - дату народження, місто або вид спорту.
*/

let yearOld = prompt(`Скільки тобі років???`);
if(yearOld == ''){
    alert(`Шкода, що Ви не захотіли ввести свій вік(((`);
}

let city = prompt(`У якому місті ти живеш???`);
if(city == ''){
    alert(`Шкода, що Ви не захотіли ввести своє місто(((`)
}

let sport = prompt(`Який вид спорту тобі подобається???`);
if(sport == ''){
    alert(`Шкода, що Ви не захотіли ввести свій улюблений вид спорту(((`)
}

if(city === `Київ`){
    switch (sport) {
        case `Волейбол`:
        alert(`Тобі ${yearOld}. Ти живеш у столиці України. Круто! Хочеш стати як Карч Кірай?`)
        break;

        case `Баскетбол`:
        alert(`Тобі ${yearOld}. Ти живеш у столиці України. Круто! Хочеш стати як Либрон Джеймс?`)
        break;

        case `Футбол`:
        alert(`Тобі ${yearOld}. Ти живеш у столиці України. Круто! Хочеш стати як Пєлє?`)
        break;

        default:
        alert(`Тобі ${yearOld}. Ти живеш у столиці України?`)
        break;
    }
}

else if(city === `Вашингтон`){
    switch (sport) {
        case `Волейбол`:
        alert(`Тобі ${yearOld}. Ти живеш у столиці США. Круто! Хочеш стати як Карч Кірай?`)
        break;

        case `Баскетбол`:
        alert(`Тобі ${yearOld}. Ти живеш у столиці США. Круто! Хочеш стати як Либрон Джеймс?`)
        break;

        case `Футбол`:
        alert(`Тобі ${yearOld}. Ти живеш у столиці США. Круто! Хочеш стати як Пєлє?`)
        break;

        default:
        alert(`Тобі ${yearOld}. Ти живеш у столиці США.`)
        break;
    }
}

else if(city === `Лондон`){
    switch (sport) {
        case `Волейбол`:
        alert(`Тобі ${yearOld}. Ти живеш у столиці Британіі. Круто! Хочеш стати як Карч Кірай?`)
        break;

        case `Баскетбол`:
        alert(`Тобі ${yearOld}. Ти живеш у столиці Британіі. Круто! Хочеш стати як Либрон Джеймс?`)
        break;

        case `Футбол`:
        alert(`Тобі ${yearOld}. Ти живеш у столиці Британіі. Круто! Хочеш стати як Пєлє?`)
        break;

        default:
        alert(`Тобі ${yearOld}. Ти живеш у столиці Британіі.`)
        break;
    }
}

else{
    switch (sport) {
        case `Волейбол`:
        alert(`Тобі ${yearOld}. Ти живеш у місті ${city}. Круто! Хочеш стати як Карч Кірай?`)
        break;

        case `Баскетбол`:
        alert(`Тобі ${yearOld}. Ти живеш у місті ${city}. Круто! Хочеш стати як Либрон Джеймс?`)
        break;

        case `Футбол`:
        alert(`Тобі ${yearOld}. Ти живеш у місті ${city}. Круто! Хочеш стати як Пєлє?`)
        break;

        default:
        alert(`Тобі ${yearOld}. Ти живеш у місті ${city}.`)
        break;
    }
} 
